{"books":[{"id":1,"name":"LordOfTheRings: The Fellowship of the Ring","description":"The Fellowship of the Ring is the first of three volumes of the epic[2] novel The Lord of the Rings by the English author J. R. R. Tolkien. It is followed by The Two Towers and The Return of the King. It takes place in the fictional universe of Middle-earth. It was originally published on 29 July 1954 in the United Kingdom. The volume consists of a prologue titled \"Concerning Hobbits, and other matters\" followed by Book I and Book II.","publisherId":3,"authorsId":[3]},{"id":2,"name":"LordOfTheRings: The Two Towers","description":"The Two Towers is the second volume of J. R. R. Tolkiens high fantasy novel The Lord of the Rings. It is preceded by The Fellowship of the Ring and followed by The Return of the King.","publisherId":3,"authorsId":[3]},{"id":3,"name":"LordOfTheRings: The Fellowship of the Ring","description":"The Return of the King is the third and final volume of J. R. R. Tolkiens The Lord of the Rings, following The Fellowship of the Ring and The Two Towers. The story begins in the kingdom of Gondor, which is soon to be attacked by the Dark Lord Sauron.","publisherId":3,"authorsId":[3]},{"id":4,"name":"A Game of Thrones","description":"A Game of Thrones is the first novel in A Song of Ice and Fire, a series of fantasy novels by American author George R. R. Martin. It was first published on August 1, 1996. The novel won the 1997 Locus Award[2] and was nominated for both the 1997 Nebula Award[2] and the 1997 World Fantasy Award. The novella Blood of the Dragon, comprising the Daenerys Targaryen chapters from the novel, won the 1997 Hugo Award for Best Novella. In January 2011 the novel became a New York Times bestseller and reached #1 on the list in July 2011","publisherId":1,"authorsId":[1]},{"id":5,"name":"Harry Potter and the Philosopher`s Stone","description":"Harry Potter and the Philosopher`s Stone is a fantasy novel written by British author J. K. Rowling. It is the first novel in the Harry Potter series and Rowling`s debut novel","publisherId":1,"authorsId":[2]},{"id":6,"name":"Harry Potter and the Prisoner of Azkaban","description":"Harry Potter and the Prisoner of Azkaban is a fantasy novel written by British author J. K. Rowling and the third in the Harry Potter series. The book follows Harry Potter, a young wizard, in his third year at Hogwarts School of Witchcraft and Wizardry.","publisherId":2,"authorsId":[2]}],"publishers":[{"id":1,"name":"Bantam Spectra"},{"id":2,"name":"Bloomsbury Publishing"},{"id":3,"name":"Allen & Unwin"}],"authors":[{"id":1,"name":"Joanne Rowling","bio":"Novelist short story writer screenwriter","birthDay":-139546800000},{"id":2,"name":"George Raymond Martin","bio":"Novelist, film producer, television producer, screenwriter","birthDay":-671598000000},{"id":3,"name":"JohnRonald Reuel Tolkien","bio":"Author, academic, philologist, poet","birthDay":115765200000}]}
